{
  "slug": "wa-timetable",
  "name": "WA Timetable (Tokyo 2025)",
  "version": "3.9.4",
  "author": "Thomas Mirmo",
  "author_profile": "https://github.com/smoothdesigns",
  "last_updated": "2025-09-19 13:32:53",
  "homepage": "https://github.com/smoothdesigns/wa-timetable",
  "download_link": "https://github.com/smoothdesigns/wa-timetable/archive/refs/tags/v3.9.4.zip",
  "requires": "5.3",
  "tested": "6.8.2",
  "requires_php": "7.2",
  "banners": {
    "banner_low": "https://cdn.jsdelivr.net/gh/smoothdesigns/wa-timetable@main/assets/banner-772x250.png",
    "banner_high": "https://cdn.jsdelivr.net/gh/smoothdesigns/wa-timetable@main/assets/banner-1544x500.png"
  },
  "sections": {
    "description": "WA Timetable is a lightweight and user-friendly WordPress plugin designed to display stylish timetables on your website. Whether you're a sports fan or a professional event organizer, this plugin provides a simple way to showcase schedules and events in a clear, accessible format.<br/><br/><strong>Features</strong><ul><li>Fully Responsive: Timetables look great on any device, from desktop computers to mobile phones.</li><li>Customizable: Easily change the look and feel of your timetable to match your website's theme via the plugin settings.</li><li>Shortcode Integration: Simply use a shortcode to embed the timetable on any page or post.</li></ul>",
    "installation": "<ol><li>Download the plugin ZIP file.</li><li>In your WordPress admin dashboard, go to <strong>Plugins > Add New</strong>.</li><li>Click the <strong>\"Upload Plugin\"</strong> button.</li><li>Choose the downloaded ZIP file and click <strong>\"Install Now\"</strong>.</li><li>After the installation is complete, click <strong>\"Activate Plugin\"</strong>.</li></ol>",
    "screenshots": "This is a screenshot of the timetable displayed on a page. ",
    "changelog": "<h4>3.9.4</h4><ul><li>**FIXED:** Corrected the GitHub updater URL to `raw.githubusercontent.com` to resolve the \"Plugin not found\" error when viewing plugin details.</li><li>**FIXED:** Updated the code to properly handle the `reset()` function, fixing the \"Only variables can be passed by reference\" fatal error on modern PHP versions.</li></ul><h4>3.9.0</h4><ul><li>**Critical Fix**: Resolved a long-standing issue where the 'LIVE' badge logic was based on an incorrect event time. The trigger threshold is now correctly calculated based on the converted Jamaica timezone.</li><li>Simplified time conversion logic by establishing a single source of truth for all time values, ensuring consistency between the displayed timetable and the plugin's debug logs.</li></ul><h4>3.0.0</h4><ul><li>This is a major release combining all previous updates into a single, cohesive version.</li><li>Major refactoring and reorganization of the core CSS file for better readability and maintainability.</li><li>Added a new 'TODAY' label for the current day's tab in the timetable navigation.</li><li>Fixed bugs related to incorrect timezone conversions, mobile device display issues, and incorrect session status when all nested units had published results.</li><li>Improved the parsing logic for timetable data to handle various event formats more reliably, including grouped qualification events.</li><li>Updated the plugin's core functionality to use a more efficient data fetching method.</li><li>Corrected \"Plugin not found\" errors by fixing object-to-array conversion issues and resolving issues with the GitHub updater class.</li><li>Refined the responsive design to ensure the timetable adapts seamlessly to all screen sizes.</li><li>Added a settings page for customization of timezones and session names.</li><li>Timetable data is now fetched and parsed dynamically from the official website.</li></ul>",
    "contribution": "We welcome contributions! If you have suggestions for improvements or want to report a bug, feel free to open a pull request or an issue on the GitHub repository.",
    "support": "If you have any questions or run into any issues, please open an issue on the GitHub repository."
  }
}